{
    "title": "MediaBear",
    "slug": "mediabear",
    "rapidapi_link":"https://rapidapi.com/brucewwx/api/mediabear",
    "date": "2025-01-02",
    "content": "**MediaBear - Your Ultimate Media Conversion and Extraction API**\n\nMediaBear is a powerful API service designed for seamless media file conversion and extraction. Whether you need to convert audio, video, or images, or extract audio tracks and images from videos, MediaBear has you covered. With a user-friendly interface and a variety of endpoints, you can easily integrate media processing capabilities into your applications.\n\n### Key Features:\n\n- **Audio Conversion:** Easily convert audio files to MP3 or WAV formats with a simple API call.\n- **Video Conversion:** Convert video files to MP4, enabling compatibility across various platforms.\n- **Image Conversion:** Transform images to JPG format effortlessly.\n- **Audio Extraction:** Extract audio tracks from videos in high-quality WAV format.\n- **Image Extraction:** Extract images from videos at customizable frames per second and choose your desired compression format (ZIP or GZIP).\n- **Media Probing:** Get detailed metadata about your media files, ensuring you have all the information you need.\n\n### Why Choose MediaBear?\n\n- **Easy Integration:** Our API is designed for simplicity and ease of use. Just send your requests, and we'll handle the rest!\n- **Reliable Performance:** Built on robust technology, MediaBear ensures fast and reliable media processing.\n- **Comprehensive Documentation:** Clear and thorough documentation helps you get started quickly.\n\nUnlock the full potential of your media files with MediaBear. Start converting and extracting today!\n\n\n\n\n# Endpoints List\n\n### Audio Conversion\n\n**`POST /convert/audio/to/mp3`**\n\n- **Description:** Convert an audio file provided in the request body to MP3 format.\n- **Response:** Downloadable MP3 file.\n\n**`POST /convert/audio/to/wav`**\n\n- **Description:** Convert an audio file provided in the request body to WAV format.\n- **Response:** Downloadable WAV file.\n\n### Video Conversion\n\n**`POST /convert/video/to/mp4`**\n\n- **Description:** Convert a video file provided in the request body to MP4 format.\n- **Response:** Downloadable MP4 file.\n\n![image](https://i.imgur.com/lIWCSpL.png)\n\n###  Image Conversion\n\n**`POST /convert/image/to/jpg`**\n\n- **Description:** Convert an image file to JPG format.\n- **Response:** Downloadable JPG file.\n\n### Audio Extraction\n\n**`POST /video/extract/audio`**\n\n- **Description:** Extract the audio track from a provided video file.\n- **Response:** Returns the audio track as a 1-channel WAV file if `mono` is set to `yes`.\n- **Query Parameter:** `mono` (default: no) - Set to \"yes\" for a mono audio track.\n\n\n### Image Extraction from Video\n\n**`POST /video/extract/images`**\n\n- **Description:** Extract images from a provided video file and receive download links.\n- **Response:** JSON containing download links to extracted images.\n- **Query Parameters:**\n  - `compress` - Choose compression format: `zip` or `gzip`.\n  - `fps` - Specify the frames per second for image extraction (default: 1).\n\n![image](https://i.imgur.com/6YxlL9A.png)\n\n### Media Probing\n\n**`POST /probe`**\n\n- **Description:** Probe a media file and return detailed metadata in JSON format.\n- **Response:** JSON object containing metadata information.\n\n\n"
}